package companys.audible;

/**
 * Created by yuboyang on 7/15/17.
 */
public class 简历问题 {
    /*

刚结束的 Audible 一面 问了5分钟简历问题 然后甩了两道题1. 把数组B按照 B中数字在另一个数组A中出现的顺序来排序 in - place 还有新建array的做法.鐣欏璁哄潧-涓€浜�-涓夊垎鍦�
2. 一串数字 连续递增 找出其中缺少的数字 没有就返回null

1. 印度小哥：开始问了hashmap的一些问题，比如什么事hashmap，如何处理collision，什么情况下需要override hashcode方法。然后问了一些简历的问题，感觉没有说好，没解释清楚。
编程问题很简单： 第一个in-level遍历二叉树；第二个合并两个排好序的linked list.鐣欏璁哄潧-涓€浜�-涓夊垎鍦�
然后当天通知第二次电面-goo

2. todo!! 美国小哥：开始问了简历，你的项目是干吗用的，最有挑战的部分是什么。然后就编程了。
编程题目：第一题给两个数组，都是整数数组。 把第二个数组排序根据第一个数组。比如第一个数组{8,2,5,7,4,3} 第二个数组{2,8,7,5}，输出结果为{8,2,5,7}。
第二题一个递增的数组，找missing number。

     */
}
